#for循环语法
#for 变量名 in 某个数据类型：（包含字符串，列表，字典，元组，集合等）
     #代码块
# a = "hello!"
# b = [1,2,3]
# c = {"age":"18","sex":"girl"}#字典类型的数据，遍历key
# print(c.values())#获取字典里的values
# print(c.keys())#获取字典里的keysc

# #for用来遍历元素，循环的次数，由数据的元素个数决定
# for item in a:#for循环遍历a里面的元素，赋值给item
#     print(item)#item变量的作用：可以将数据里的值取出来，也可以用来决定循环次数
#     print("哈哈哈哈哈哈")
# for a in c:
#     print(c[a])#遍历key的值，然后取出对应的values的值

# homework
# L = [5,6,9,3,7]#利用for循环进行相加
# sum = 0
# for h in L:
#     sum += h
# print(sum)
#**********************************************************************************************************************
# range函数：作用：生成整数序列
#range(m,n,k) m：头，默认为0，n:尾，k:步长默认为1，取头不取尾
#例：
#range（1，5，1）#1，2，3，4
#range（1，6，2）#1，3，5
#range（8）#0，1，2，3，4，5，6，7

#homework
# L = [5,6,9,3,7]#,利用for循环，根据L的索引值，打印出每个元素的值
# for item in range(len(L)):
#     print(L[item])

# #嵌套循环#把列表里每一个元素单独打印出来
# l = [["眼睛","她","下雨","心","打伞"],["最好的","不经意","出现"]]
# for item in l:
#     for a in item:
#         print(a)

# for i in range(6):
#     for j in range(1,i+1):
#         print("*",end='')#end=''print打印后会自动换行，在循环中代表不换行处理
#     print("")

#冒泡排序：小的拍前面，大的排后面。冒泡算法：两两相比，进行排序，一般n-1就完成了
#排序最终使得数组中的这几个数字按照从小到大的顺序排序
#冒泡的概念 关系到你接下来怎么写程序
#经典冒泡算法：利用for循环，完成a=[1，7，4，89，34，2]
a=[1,7,4,89,34,2]








